app/views/tenants/show.html.erb

                            <%if @property %>
                                    <% @tenant.rent.each do |r| %>
---
SELECT "rents".* FROM "rents" INNER JOIN "rents_tenants" ON "rents"."id" = "rents_tenants"."rent_id" WHERE "rents_tenants"."tenant_id" = $1  [["tenant_id", 2]]