app/controllers/landlords_controller.rb

  def index
    @landlords = Landlord.all
---
SELECT "landlords".* FROM "landlords"

  def show
    @landlord = Landlord.find(params[:id])
---
SELECT  "landlords".* FROM "landlords" WHERE "landlords"."id" = $1 LIMIT 1  [["id", 0]]

  def create
     params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:landlord])
    @landlord = Landlord.new(params_map)
    if @landlord.save
---
INSERT INTO "landlords" ("last_name", "office_address", "phone_number", "email", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"