app/controllers/managers_controller.rb

    def show
        @manager = Manager.find(session[:user_id])
        @joinrequests = Joinrequest.where(:manager_id => @manager)
        if !@joinrequests.empty?
            @JRBundles = Array.new
            @joinrequests.each do |i|
                newBundle = OpenStruct.new
                newBundle.joinRequest = i
                newBundle.property = Property.find(i.property_id)
                newBundle.tenant = Tenant.find(i.tenant_id)
                @JRBundles.push(newBundle)
            end
        end
        @properties = Property.where(:manager_id => @manager)
        @services = Service.where("manager_id = ? AND resolved = ?", @manager, false)
        @propRents = Hash.new
        @properties.each do |p|
            @rents = Rent.where(:property_id => p)
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "joinrequests".* FROM "joinrequests" WHERE "joinrequests"."manager_id" = 1
SELECT COUNT(*) FROM "joinrequests" WHERE "joinrequests"."manager_id" = 25
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", 21]]
SELECT "services".* FROM "services" WHERE (manager_id = 25 AND resolved = 'f')
SELECT "rents".* FROM "rents" WHERE "rents"."property_id" = 1

    def update
        @manager = Manager.find(session[:user_id])
        params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:manager])
        @manager.update(params_map)
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 25]]
UPDATE "managers" SET "name" = $1, "email" = $2, "phone_number" = $3, "updated_at" = $4 WHERE "managers"."id" = $5  [["name", "Charles Powicki"], ["email", "chpowicki@gmail.com"], ["phone_number", "7744874638"], ["updated_at", "2017-11-26 20:54:19.465815"], ["id", 25]]

    def edit
        @manager = Manager.find(session[:user_id])
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 25]]

    def respond
        @joinrequest = Joinrequest.find(params[:id])
        if params[:op] == 'accept'
            @property = Property.find(@joinrequest.property_id)
            if @property.max_num_tenants == @property.curr_num_tenants
                flash[:notice] = "This property is full right now!"
                return
            end
            @property.curr_num_tenants += 1
            @tenant = Tenant.find(@joinrequest.tenant_id)
            @tenant.property_id = @joinrequest.property_id
            @currRent = Rent.where("property_id = ? AND (due = ? OR due = ?)",  @joinrequest.property_id, Time.now + 1.month, Date.new(Time.now.year + 1, 1, 1)).first
            if @currRent
                @tenant.rent << @currRent
                @currRent.save
                @tenant.save
---
SELECT  "joinrequests".* FROM "joinrequests" WHERE "joinrequests"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", 25]]
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", 21]]
SELECT  "rents".* FROM "rents" WHERE (property_id = 1 AND (due = '2018-01-08 21:53:54.264983' OR due = '2018-01-01'))  ORDER BY "rents"."id" ASC LIMIT 1
INSERT INTO "rents" ("property_id", "manager_id", "total", "due", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["property_id", 1], ["manager_id", 25], ["total", 5000], ["due", "2018-01-07"], ["created_at", "2017-12-07 03:09:37.496289"], ["updated_at", "2017-12-07 03:09:37.496289"]]
UPDATE "properties" SET "curr_num_tenants" = $1, "updated_at" = $2 WHERE "properties"."id" = $3  [["curr_num_tenants", 1], ["updated_at", "2017-12-08 21:50:09.210066"], ["id", 1]]
UPDATE "tenants" SET "property_id" = $1, "updated_at" = $2 WHERE "tenants"."id" = $3  [["property_id", 2], ["updated_at", "2017-11-26 01:44:49.055340"], ["id", 21]]

            end
            @property.save
        end
        @joinrequest.delete
---
DELETE FROM "joinrequests" WHERE "joinrequests"."id" = $1  [["id", 1]]