app/controllers/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT "properties".* FROM "properties"