app/controllers/properties_controller.rb

  def index
    @manager = Manager.find(session[:user_id])
    @properties = Property.where(:manager_id => @manager)
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "properties".* FROM "properties" WHERE "properties"."manager_id" = 2

  def show
    @property = Property.find(params[:id])
    @tenants = Tenant.where(:property_id => @property.id)
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", 0]]
SELECT "tenants".* FROM "tenants" WHERE "tenants"."property_id" = $1  [["property_id", 8]]

  def create
    params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:property])
    @property = Property.new(params_map)
    @property.manager_id = session[:user_id]
    if @property.valid?
          @property.save
---
INSERT INTO "properties" ("name", "address", "notes", "manager_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test"], ["address", ""], ["notes", ""], ["manager_id", 1], ["created_at", "2017-11-02 02:47:21.661782"], ["updated_at", "2017-11-02 02:47:21.661782"]]

  def edit
    @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
  @property = Property.find(params[:id])
  @property.destroy
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 2]]