app/controllers/services_controller.rb

    def new
        @tenant = Tenant.find(session[:user_id])
        @property = Property.find(@tenant.property_id)
---
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", 1]]

    def respond
        @service = Service.find(params[:id])
        @service.response = params[:services][:response]
        @service.resolved = true
        @service.save
---
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "services" SET "response" = $1, "resolved" = $2, "updated_at" = $3 WHERE "services"."id" = $4  [["response", "Here's my response"], ["resolved", "t"], ["updated_at", "2017-12-08 23:22:02.462561"], ["id", 1]]

    def create
        params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:services])
        @service = Service.new(params_map)
        @tenant = Tenant.find(session[:user_id])
        @property = Property.find(@tenant.property_id)
        @manager = Manager.find(@property.manager_id)
        @service.manager_id = @manager.id
        @service.property_id = @property.id
        @service.tenant_id = @tenant.id
        #sets resolved to false, only tenants have the ability to set these to completed
        @service.resolved = false
        if @service.save
---
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 25]]
INSERT INTO "services" ("name", "address", "room", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Mike"], ["address", "22"], ["room", "444"], ["notes", "Broken"], ["created_at", "2017-12-06 03:49:25.248804"], ["updated_at", "2017-12-06 03:49:25.248804"]]

    def show
        @service = Service.find(params[:id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 1]]