app/controllers/sessions_controller.rb

  def create
    auth=request.env["omniauth.auth"]
    user=Manager.find_by(:provider => auth["provider"], :uid => auth["uid"]) ||
      Manager.create_with_omniauth(auth)
---
INSERT INTO "managers" ("provider", "uid", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["provider", "facebook"], ["uid", "1668934303159331"], ["name", "Griffin Sandler"], ["created_at", "2017-11-01 20:30:56.759838"], ["updated_at", "2017-11-01 20:30:56.759838"]]
SELECT  "managers".* FROM "managers" WHERE "managers"."provider" = $1 AND "managers"."uid" = $2 LIMIT 1  [["provider", "facebook"], ["uid", "1668934303159331"]]