app/controllers/sessions_controller.rb

SELECT  "managers".* FROM "managers" WHERE "managers"."email" = $1 AND "managers"."password" = $2 LIMIT 1  [["email", "tenant1@gmail.com"], ["password", "1234"]]
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."email" = $1 AND "tenants"."password" = $2 LIMIT 1  [["email", "tenant1@gmail.com"], ["password", "1234"]]
SELECT  "managers".* FROM "managers" WHERE "managers"."provider" = $1 AND "managers"."uid" = $2 LIMIT 1  [["provider", "facebook"], ["uid", "1729459897087761"]]
---
  def new
    if params[:op] == 'local'
      params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:session])
      user=Manager.find_by(:email => params_map["email"], :password => params_map["password"]) || Tenant.find_by(:email => params_map["email"], :password => params_map["password"])
    else
      auth=request.env["omniauth.auth"]
      user=Manager.find_by(:provider => auth["provider"], :uid => auth["uid"]) || Tenant.find_by(:provider => auth["provider"], :uid => auth["uid"])

INSERT INTO "managers" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Landlord 1"], ["email", "landlord@gmail.com"], ["password", "1234"], ["created_at", "2017-11-16 01:45:10.370355"], ["updated_at", "2017-11-16 01:45:10.370355"]]
---
  def createManager
    auth = session[:auth]
    if Tenant.where(:email => auth["info"]["email"]).exists? || Tenant.where(:email => params[:email]).exists?
      flash[:notice] = "Email already in use."
      redirect_to '/create'
    else
      if params[:op] == 'local'
        params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:manager])
        user = Manager.new(params_map)
        if !user.save

INSERT INTO "tenants" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New Tenant"], ["email", "tenant1@gmail.com"], ["password", "1234"], ["created_at", "2017-11-16 01:47:21.584714"], ["updated_at", "2017-11-16 01:47:21.584714"]]
---
  def createTenant
    auth = session[:auth]
    if Manager.where(:email => auth["info"]["email"]).exists? || Manager.where(:email => params[:email]).exists?
      flash[:notice] = "Email already in use."
      redirect_to '/create'
    else
      if params[:op] == 'local'
        params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:tenant])
        user = Tenant.new(params_map)
        if !user.save

SELECT  "properties".* FROM "properties" WHERE "properties"."address" = $1 LIMIT 1  [["address", "123 Main Street, New Orleans LA 70118"]]
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 25]]
SELECT  "properties".* FROM "properties" WHERE "properties"."address" = $1 AND "properties"."manager_id" = $2 LIMIT 1  [["address", "123 Main Street, New Orleans LA 70118"], ["manager_id", 25]]
---
  def search
      params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:query])
      @result = Property.where(:address => params_map[:address]).take
      if @result
        @manager = Manager.find(@result.manager_id)

INSERT INTO "joinrequests" ("resolved", "manager_id", "property_id", "tenant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["resolved", "f"], ["manager_id", 1], ["property_id", 2], ["tenant_id", 21], ["created_at", "2017-11-26 01:28:12.237004"], ["updated_at", "2017-11-26 01:28:12.237004"]]
---
  def sendreq
    newReq = Joinrequest.new(:resolved => false, :manager_id => params[:id], :property_id => params[:pid], :tenant_id => session[:user_id])
    newReq.save