app/controllers/tenants_controller.rb

  def show
    @tenant = Tenant.find(session[:user_id])
   #makes sure tenant has a property id to search for its roommates, property, and services#
    unless @tenant.property_id.blank?
      @property = Property.find(@tenant.property_id)
      @roommates = Tenant.where("property_id = ? AND id != ?", @property.id, @tenant.id)
      @services = Service.where("tenant_id = ? AND resolved = ?", @tenant.id, true)
      @roommateRentTot = 0
      #checks if roommates are empty before calculating total rent
      unless @roommates.empty?
---
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", 8]]
SELECT "services".* FROM "services" WHERE (tenant_id = 1 AND resolved = 't')
SELECT COUNT(*) FROM "tenants" WHERE (property_id = 1 AND id != 1)

  def service
    @service = Service.find(params[:id])
    if params[:op] == 'completed'
      @service.delete
    else
      @service.resolved = false
      @service.save
---
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 1]]
UPDATE "services" SET "resolved" = $1, "updated_at" = $2 WHERE "services"."id" = $3  [["resolved", "f"], ["updated_at", "2017-12-08 23:47:38.372247"], ["id", 2]]

  def edit
    @tenant = Tenant.find(session[:user_id])
---
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", 1]]

  def update
      @tenant = Tenant.find(session[:user_id])
      params_map = ActiveSupport::HashWithIndifferentAccess.new(params[:tenant])
      @tenant.update(params_map)
---
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "tenants" SET "name" = $1, "email" = $2, "phone_number" = $3, "rentNum" = $4, "updated_at" = $5 WHERE "tenants"."id" = $6  [["name", "Charles Powicki"], ["email", "chpowicki@gmail.com"], ["phone_number", "7744874638"], ["rentNum", 800], ["updated_at", "2017-12-08 22:24:57.252868"], ["id", 1]]

  def dummypay
    @rent = Rent.find(params[:id])
    @tenant = Tenant.find(session[:user_id])
    @rent.total -= @tenant.rentNum
    @rent.save
---
SELECT  "rents".* FROM "rents" WHERE "rents"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "rents" SET "total" = $1, "updated_at" = $2 WHERE "rents"."id" = $3  [["total", 39600], ["updated_at", "2017-12-07 03:57:09.467413"], ["id", 1]]